hybridMultiphaseFoamV7/tutorials/Darcy_Flow_Cases/Gravity_Capillarity_Balance/Gravity_Capillarity_BrooksCorey/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6000;
        startFace       1499;
    }
    leftWall
    {
        type            patch;
        nFaces          1;
        startFace       7499;
    }
    rightWall
    {
        type            patch;
        nFaces          1;
        startFace       7500;
    }
)

// ************************************************************************* //
