hybridMultiphaseFoamV7/tutorials/Darcy_Flow_Cases/Gravity_Capillarity_Balance/Gravity_Capillarity_BrooksCorey/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

wetting //alpha=1 wetting alpha1 ("b" if compared to multiphase toolbox)
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;
    rho             [1 -3 0 0 0 0 0] 1000;   
}

nonWetting //alpha=0 nonwetting alpha2 = 1-alpha1 ("a" in multiphase toolbox)
{
   transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5; //in unitns of kinematic viscocity
    rho             [1 -3 0 0 0 0 0] 1; 
}

// Two Phase Models

activateCapillarity     1;

sigma            [1 0 -2 0 0 0 0]  0.077;

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel  BrooksAndCorey;
capillarityModel           BrooksAndCorey;

BrooksAndCoreyCoeffs
{
    n 2;
    Sbminpc Sbminpc [0 0 0 0 0 0 0] 0;
    Sbmaxpc Sbmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 1000;
    alpha 0.5;	
}
// ************************************************************************* //
